//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//‘%’只作用于整数，‘+、-、*、/’可作用于整数、浮点数
// ‘/’两操作数都为整数执行整数除法，若有一个以上浮点数执行浮点数除法
// ‘%’的两个操作数必须是整数，返回的值为整除之后的余数
//int main()
//{
//	int a = 5 / 2;
//	int b = 5 % 2;
//	double c = 5.0 / 2;
//	printf("a=%d\nb=%d\nc=%lf\n", a, b, c);
//	return 0;
//}

//#include <stdio.h>
//右移操作符：>> 1、算术右移：右边丢弃，左边补原符号位   2、逻辑右移：右边丢弃，左边补0
//左移操作符：<< 2、左边丢弃，右边补0
//注意：不要移动负数位   例：a>>-1(这个标准未定义)
//int main()
//{
//	 //整数的二进制表示有：原码、反码、补码
//    //存储到内存的是补码
//   //移动的是二进制位
//
//	int a = 16;
//	int b = a >> 1;
//	int c = a << 1;
//          //a = 00000000000000000000000000001000
//	    //a补 = 00000000000000000000000000001000
////a补右移一位 = 00000000000000000000000000000100
//   	    //b补 = 00000000000000000000000000000100
//   //b = a>>1 = 00000000000000000000000000000100 = 8
////a补左移一位 = 00000000000000000000000000010000
//        //c补 = 00000000000000000000000000010000
//   //c = a<<1 = 00000000000000000000000000010000 = 32
//
//	int d = -4;
//	int e = d >> 1;
//	int f = d << 1;
//	      //d = 10000000000000000000000000000100
//	    //d补 = 11111111111111111111111111111100
////d补右移一位 = 11111111111111111111111111111110
// 	    //e补 = 11111111111111111111111111111110 
//   //e = d>>1 = 10000000000000000000000000000010 = -2
////d补左移一位 = 11111111111111111111111111111000
//	    //f补 = 11111111111111111111111111111000
//   //f = d<<1 = 10000000000000000000000000001000 = -8
//
//	printf("b=%d\nc=%d\ne=%d\nf=%d\n", b, c, e, f);
//	return 0;
//}


//#include <stdio.h>
//位操作符：1、按位与（&）：有0则0   2、按位或（|）：有1则1    3、按位异或：（^)：相同为0，不同为1
//都是以补码进行运算
//int main()
//{
//	int a = -3;
//	int b = 5;
//	//a补 = 11111111111111111111111111111101
//	//b补 = 00000000000000000000000000000101
//	int c = a & b;
////(a&b)补 = 00000000000000000000000000000101
//	//a&b = 00000000000000000000000000000101 = 5
//	int d = a | b;
////(a|b)补 = 11111111111111111111111111111101
//	//a|b = 10000000000000000000000000000011 = -3
//	int e = a ^ b;
////(a^b)补 = 11111111111111111111111111111000
//	//a^b = 10000000000000000000000000001000 = -8
//	printf("c=%d\nd=%d\ne=%d\n", c, d, e);
//	return 0;
//}


//不能创建临时变量，实现两个字的交换
//#include <stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("before:a=%d b=%d\n", a, b);
//	//加减法，可能会溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//	//异或的方法
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("after:a=%d b=%d\n", a, b);
//	return 0;
//}


//求一个整数存储在内存中的二进制中1的个数
//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);

	//统计num的补码中有几个1
	//while (num)
	//{
	//	if (num % 2 == 1)
	//	{
	//		count++;
	//	}
	//	num = num / 2;
	//}

	//上面这个算法存在问题，负数算不出来
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))
//		{
//			count++;
//		}
//	}
//
//	printf("count=%d\n", count);
//	return 0;
//}

//赋值操作符：=、+=、-=、*=、/=、&=、|=、^=、>>=、<<=
//#include <stdio.h>
//int main()
//{
//	int a = 1;
//	int b = 1;
//	int c = 1;
//	int d = 1;
//	int e = 1;
//	int f = 1;
//	int g = 1;
//	int h = 1;
//	int i = 1;
//	int j = 1;
//	a += 1;//a = a + 1
//	b -= 1;//b = b - 1
//	c *= 1;//c = c * 1
//	d /= 1;//d = d / 1
//	e &= 1;//e = e & 1
//	f ^= 1;//f = f ^ 1
//	g |= 1;//g = g | 1
//	h >>= 1;//h = h >> 1
//	i <<= 1;//i = i << 1
//	j %= 1;//j = j % 1
//	printf("a=%d b=%d c=%d d=%d e=%d f=%d g=%d h=%d i=%d j=%d\n", a, b, c, d, e, f, g, h, i, j);
//	return 0;
//}

//单目操作符： 只有一个操作数的
            //  ！（逻辑反操作）、 -（负值）、 +（正直）、 &（取地址）、 sizeof（操作数的类型长度，以字节为单位）
              //~（对一个数的二进制按位取反）、 --（前置、后置--）、 ++（前置、后置++）、
              //*（间接访问操作符/解引用操作符）、 （类型）：（强制类型转换）
#include <stdio.h>
//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//4
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//4,传过去的是数组首元素的地址，地址需要指针来接收，指针的大小：32平台为4,64平台为8
//}
int main()
{
//！：真变假，假变真
	//int a = 0;
	//if (a)
	//{
	//	printf("hehe\n");
	//}
	//if (!a)
	//{
	//	printf("haha\n");
	//}

//&：取地址操作符，一般配合指针使用
	//int a = 10;
	//int* p = &a;//取地址操作符&（p里面存的是a的地址，int*是指针变量的类型）
	//*p = 20;//解引用操作符*（*p就是a的值的意思）
	//printf("%d\n", a);

//sizeof：计算变量所占内存空间的大小，单位是字节
	//int a = 10;
	//char c = 'r';
	//char* p = &c;
	//int arr[10] = { 0 };
	//printf("%d\n", sizeof(a));//4
	//printf("%d\n", sizeof(int));//4

	//printf("%d\n", sizeof(c));//1
	//printf("%d\n", sizeof(char));//1

	//printf("%d\n", sizeof(p));//4
	//printf("%d\n", sizeof(char*));//4

	//printf("%d\n", sizeof(arr));//40
	//printf("%d\n", sizeof(int[10]));//40

//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));//2
//	printf("%d\n", s);//0

	//int arr[10] = { 0 };
	//char ch[10] = { 0 };
	//printf("%d\n", sizeof(arr));//40
	//printf("%d\n", sizeof(ch));//10
	//test1(arr);
	//test2(ch);

//~：对一个数的二进制按位取反
	//先把数字化为二进制，再化为补码，然后取反，取反之后在变回原码
	/*int a = -2;
	int b = 1;
	printf("%d\n", ~a);
	printf("%d\n", ~b);*/
	
	//int a = 11;
	////把低位的第三位置变成1
	////00000000000000000000000000001011
	////00000000000000000000000000000100  用按位或|  有1则1
	////00000000000000000000000000001111
	//a = a | (1 << 2);
	//printf("%d\n", a);//15
	////再变回去
	////00000000000000000000000000001111
	////11111111111111111111111111111011  用按位与&  有0则0
	////00000000000000000000000000001011
	//a = a & (~(1 << 2));
	//printf("%d\n", a);//11

//--、++（前置--、,后置--、前置++、后置++）
	//int a = 10;
	////printf("%d\n", a++);//后置++，先使用，后++
	//printf("%d\n", ++a);//前置++，先++，后使用
	////其余类似

//（类型）：强制类型转换
	//int a = 3.14;//会报警告
	//int a = (int)3.14;//强制类型转换
	/*return 0;
	return 0;
}