//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//int main()
//{
//	int a = 20;//4个字节，32个bit
//	//00000000000000000000000000010100--原码       
//	//00000000000000000000000000010100--反码
//	//00000000000000000000000000010100--补码
//	//0x00000014(0x：16进制）      内存里面是反过来记录的14 00 00 00
//	int b = -10;                                     
//	//10000000000000000000000000001010--原码          //内存
//	//11111111111111111111111111110101--反码         低|——————————————————————|高
//	//11111111111111111111111111110110--补码         地|  00 00 00 14             14 00 00 00       |地
//	//0xFFFFFFF6(0x：16进制）      F6 FF FF FF       址|——————————————————————|址
//	return 0;                        //                  大端存储模式              小端存储模式
//}
//字节存储的顺序
//大端（存储）模式：是指数据的低位保存在内存的高地址中，而数据的高位保存在内存的低地址中
//小端（存储）模式：是指数据的低位保存在内存的低地址中，而数据的高位保存在内存的高地址中

//写一段代码告诉我们当前机器的字节序是什么
//#include <stdio.h>
//int check_sys(void)
//{
//	int a = 1;
//	//char* p = (char*)&a;             
//	////if (*p == 1)                  
//	////{                              
//	////	return 1;                  
//	////}                              
//	////else
//	////{
//	////	return 0;
//	////}
//	//return *p;//优化27-34的代码
//	return *(char*)&a;//优化26-35的代码
//}
//int main()
//{
//	//int a = 1;//在内存中的字节存储顺序 1. 00 00 00 01  2. 01 00 00 00
//	//char* p = (char*)&a;
//	//if (*p == 1)
//	//{
//	//	printf("小端存储模式\n");
//	//}
//	//else
//	//{
//	//	printf("大端存储模式\n");
//	//}
//	//返回1,小端。返回0,大端
//
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端存储模式\n");
//	}
//	else
//	{
//		printf("大端存储模式\n");
//	}
//	return 0;
//}

//指针类型的意义
//1.指针类型决定了指针解引用操作符能访问几个字节
//char* p： *p访问1个字节 、  int* p：*p访问4个字节
//2.指针类型决定了指针+1、-1，加或者减多少个字节
//char* p：p+1,跳过了一个字节  、 int* p：p+1,跳过一个整型（4个字节）
//

//练习
//1.结果是什么？
//#include <stdio.h>
//int main()
//{
//	//整型提升：以符号位数字加够32位
//	char a = -1;
//	//-1的原码：10000000000000000000000000000001
//	//-1的反码：11111111111111111111111111111110
//	//-1的补码：11111111111111111111111111111111
//	//因为是char类型只能存储8个bit，所以内存中存储的是：11111111  最高位为符号位
//	//因为要打印的是整型（%d），所以要整型提升11111111111111111111111111111111  最高位为符号位
//	//整型提升后再转为原码100000000000000000000000000000001
//	//最终结果：-1
//	signed char b = -1;//带符号的char
//	//-1的原码：10000000000000000000000000000001
//	//-1的反码：11111111111111111111111111111110
//	//-1的补码：11111111111111111111111111111111
//	//因为是char类型只能存储8个bit，所以内存中存储的是：11111111  最高位为符号位
//	//因为要打印的是整型（%d），所以要整型提升11111111111111111111111111111111  最高位为符号位
//	//整型提升后再转为原码100000000000000000000000000000001
//	//最终结果：-1
//	unsigned char c = -1;//不带符号的char
//	//-1的原码：10000000000000000000000000000001
//	//-1的反码：11111111111111111111111111111110
//	//-1的补码：11111111111111111111111111111111
//	//因为是char类型只能存储8个bit，所以内存中存储的是：11111111  最高位不是符号位
//	//因为要打印的是整型（%d），所以要整型提升，又因为char不带符号，所以整形提升后：00000000000000000000000011111111 最高位不是符号位
//	//整型提升后再转为原码000000000000000000000000011111111
//	//最终结果：255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//2.输出结果是什么？
//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	//-128的原码：10000000000000000000000010000000
//	//-128的反码：11111111111111111111111101111111
//	//-128的补码：11111111111111111111111110000000
//	//因为是char类型只能存储8个bit，所以内存中存储的是：10000000  最高位为符号位
//	//整型提升：11111111111111111111111110000000  最高位是符号位
//	//因为要将数据当做无符号整数打印（%u），所以最高位当做不是符号位
//	// 整型提升后再转为原码：11111111111111111111111110000000
//	//最终结果：4294967168
//	printf("%u\n", a);
//	return 0;
//}

//3.输出的结果是什么？
//#include <stdio.h>                      
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);//结果跟上面的一样4234967168
//	//因为char a 最大只能存储127，所以char a = 128相当于char a = -128
//	return 0;
//}
//   signed char(范围：-128——127）                       unsigned char(范围：0——255）
//  . . -4 -3 -2 -1 | 0 1 2 3 4 5 . .                     . . 253 254 255 | 0 1 2 3 4 5 . .
//  . |———>———|————>——| .                     . |———>———|———>———| .
//  . |             |             | .                     . |             |             | .
//  . |    signed   |    char     | .                     . |   unsigned  |   char      | .
//  . |             |             | .                     . |             |             | .
//  . |             |             | .                     . |             |             | .
//  . |———<———|———<———| .                     . |———<———|———<———| .
//  . . . -127 -128 | 127 126 125 . .                     . . 130 129 128 | 127 126 125 . .          

//4.按照补码的形式计算，最后格式化为有符号整数，输出结果为？
//#include <stdio.h>
//int main()
//{
//	int i = -20;
//	//原码：10000000000000000000000000010100
//	//补码：11111111111111111111111111101100
//	unsigned int j = 10;
//	//原码：00000000000000000000000000001010
//	//补码：00000000000000000000000000001010
//	printf("%d\n", i + j);
//	//i+j的补码：11111111111111111111111111110110
//	//i+j的原码：10000000000000000000000000001010
//	return 0;
//}

//5.输出结果为？
//#include <stdio.h>
//#include <windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);//9,8,7,6,5,4,3,2,1,0,4294967295,4294967294........
//		Sleep(100);//打印后暂停1s再打印，需要引用头文件#include <windows.h>
//	}
//	return 0;
//}

//6.输出的结果？
//#include <stdio.h>
//#include <string.h>
//int main()
//{
//	char a[1000];//范围-128--127
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));//虽然char a[1000]里面没有'\0'，但结果也不是随机值
//	//char a [1000]里面存放的为：-1，-2.......-128,127,126......3,2,1,0,-1,-2,-3....
//	//strlen(a):计算出的是0前面的个数
//	//最终结果255
//	return 0;
//}

//7.打印了多少次？
//#include <stdio.h>
//unsigned char i = 0;//范围0--255，即i的范围
//int main()
//{
//	for (i = 0; i <= 255; i++)//当i=256时，会转化为0，当i=257时，换转化为1......
//	{
//		printf("hello world\n");//死循环
//	}
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	double d = 1E10;//1.0x10^10
//	printf("%lf\n", d);
//	return 0;
//}

//浮点数存储的例子
//#include <stdio.h>
//int main()
//{
//	int n = 9;
//	//内存中的存储形式：00000000000000000000000000001001-补码
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.000000（%f只打印到小数点的后六位)
//	//以浮点型的形式取出来
//	//0 00000000 00000000000000000001001 (-1)^0 * 0.00000000000000000001001 * 2^-126
//	//以浮点型的形式打印出来：0.000000
//	
//	*pFloat = 9.0;
//	//1.001 * 2^3
//	//内存中的存储形式：0 10000010 00100000000000000000000
//	printf("n的值为：%d\n", n);//当做整型数字直接打印：1091567616
//	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
//	return 0;
//}//整型与浮点型的存取方式不同

//单精度浮点数存储
//#include <stdio.h>
//int main()
//{
//	float f = 5.5;
//	//写成二进制：101.1（1.011*2^2) S=0(实际存的就是0）,M=1.011(实际存的011),E=2(实际存的E+127=129,即10000001)
//	//0 10000001 01100000000000000000000(打开内存监视窗口，里面是十六进制，转换如下）
//	//40 b0 00 00  小端存储模式：所以内存显示是：00 00 b0 40
//	return 0;
//}

//双精度浮点数存储
//#include <stdio.h>
//int main()
//{
//	double f = 5.5;
////写成二进制：101.1（1.011*2^2）S=0(实际上存的就是0）M=1.011（实际上存的是011）E=2（实际上存的是E+1023=1025，即10000000001）
//    //0 10000000001 0110000000000000000000000000000000000000000000000000
//	//40 16 00 00 00 00 00 00
//	return 0;
//}